{"meta":{"title":"dajava的博客","subtitle":"不是你的错，错的是这个世界！","description":null,"author":"古佩","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"一个程序员的爱情故事","slug":"一个程序员的爱情故事","date":"2017-07-05T01:08:37.000Z","updated":"2017-07-05T01:11:47.000Z","comments":true,"path":"2017/07/05/一个程序员的爱情故事/","link":"","permalink":"http://yoursite.com/2017/07/05/一个程序员的爱情故事/","excerpt":"","text":"小伟毕业后顺利的进了一家软件公司，他天生就是干这行的料。不爱说话，不善于言谈，热衷于解决程序中的难题，程序员的这些标签都贴在了他的身上。 每次解决一个难题，小伟总习惯对着电脑傻笑一会。刚开始大家都以为他脑子有点问题，后来久了也就习惯了。 突然有一天，公司来了一名女程序员。在他看来她一点没有程序员的样貌，长发飘飘，一副大边框的眼镜里藏着一双美丽的大眼睛，连走路时身边带过来的风都夹着淡淡的清香。 她的位置被安排在了小伟边上，她向小伟问好同时对他笑了一下。 就这个很平常的举动让小伟有些不知所措，她的微笑足以埋没他当天发现的所有Bug。 美女是刚毕业的小妹妹，在工作中难免有很多问题需要问小伟，小伟总是很快的帮她解决了。美女进步很快，为了答谢这段时间来小伟对她的帮助，她请他吃了个饭。 饭桌上，几乎是美女一个在说话，或者说是美女在审问他，她问一句，他答一句。但小伟也是个男人，也有男人都有的想法，但却没有男子汉应该有的勇气，一直红着脸低头吃饭。最后忍不住想看她一眼，却差点噎着了。 生活又在平淡中过了半年，一个晚上，他依然一个人在办公室里加班。突然她给她打了个电话，她说她喝多了，让他去接她。 他见到她的时候，她是撑到了极限。如果他晚点到，她可能就睡地上了。 她刚问完她的地址，她就醉倒了。她吃力的扶着她上了出租车，这也许是他第一次能如此近距离的和美女接触，能如此近距离的味着长发的味道。她费了好大的劲终于把她弄到了屋里，他自己也累得倒在了她边上。房间很静，他能听到她的心跳，能感受到她呼吸的空气撞到他脸上……。 他感觉自己心跳的频率比处理线上支付系统的Bug跳得还要快，他想尝试靠近她一点。就在这时，她吐了出来，弄得两个人一身污垢。 他给自己和她简单擦了一下，然后他拿出了电脑继续写代码。本来三天的工作量，他一个晚上就写完了，效率高得连他自己都不敢相信。 第二天她醒后，连连说谢谢。她说她和男友分手了，心情不好，然后自己跑出去喝酒了，要不是他还真不知道会发生什么事。 这以后，他工作总是心不在焉了。终于，有一天，她要他帮忙解决一个难题。他很快帮她写过完了，他把他对她的喜欢写在了代码注释里，希望她能看到。除了这种方式，他找不出更好表达自己想法的办法了。可没想到那天她有事，代码直接被她提交了，上线后就再也没有改过这个地方。 图0：一个程序员的爱情故事 他一直希望那些地方再出一个bug，让她重新再看到她写给她的心里话. 他等了几个月，发现她和之前没什么区别，后来他就离职了。公司给他涨了50%的工资都没能留下他。 后来的几年里，他又换了几家公司。 今年，他到一家大公司面式的时候，最后的技术总监问他干技术这么多年，最让他揪心的事是什么。 他把他的这个故事和面试官说了。 最后面试官问他这女孩子到现在有没有联系过你。 他摇了摇头。 面试官说了一句：` ` ` `你被录用了，这么多年，那女孩子都没有联系你，说明你写的代码很稳定。","categories":[],"tags":[]},{"title":"摘抄","slug":"excerpt","date":"2017-06-14T05:44:56.000Z","updated":"2017-07-05T01:33:22.000Z","comments":true,"path":"2017/06/14/excerpt/","link":"","permalink":"http://yoursite.com/2017/06/14/excerpt/","excerpt":"","text":"我怎么敢倒下，我的身后空无一人 哈哈哈哈，我已经通读了刑法，我发现我想做的事情，是不会判死刑的！手动笑。 没有人的生活是容易的，如果你觉得容易了，那是有人承担了你的那份不易 情之所起，一往情深，又或是相识而笑，离亦挂心。不必在意得失，不必在意过往，踏过山水看过花落，待到耄耋之年细数回忆，虽是平生淡淡，但其中有你，便是满心欢喜","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"}]}]}